Documents/РасходДСПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходДСПлан</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОД_ДоговорСЗаказчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_ИзППМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОД_ОтветственныйПрораб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыУтвержденияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыУтвержденияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходДСПлан/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ТекстЗапросаН = Список.ТекстЗапроса;
	
	ПЗ_Н = "ДокументРасходДСПлан.Автор КАК Автор,";
	ПН_Н = "ДокументРасходДСПлан.Автор КАК Автор, ДокументРасходДСПлан.ОД_ДоговорСЗаказчиком КАК ДоговорСЗаказчиком, ДокументРасходДСПлан.ОД_ИзППМ КАК ИзППМ,";
	ТекстЗапросаН = СтрЗаменить(ТекстЗапросаН, ПЗ_Н, ПН_Н);
	
	Список.ТекстЗапроса = ТекстЗапросаН;
	
	ЭлементДоговорСЗаказчиком = Элементы.Добавить("ОД_ДоговорСЗаказчиком", Тип("ПолеФормы"), Элементы.Список);
	ЭлементДоговорСЗаказчиком.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДоговорСЗаказчиком.ПутьКДанным = "Список.ДоговорСЗаказчиком";
	
	ЭлементИзППМ = Элементы.Добавить("ОД_ИзППМ", Тип("ПолеФормы"), Элементы.Список);
	ЭлементИзППМ.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементИзППМ.ПутьКДанным = "Список.ИзППМ";
	ЭлементИзППМ.Заголовок = "Из ППМ";
	Если Пользователи.РолиДоступны("АдминистраторСистемы",Пользователи.ТекущийПользователь()) Тогда
		Ком_ДобавитьФайл = ЭтаФорма.Команды.Добавить("Команда_Утвердить");
		Ком_ДобавитьФайл.Заголовок = "Утвердить";
		Ком_ДобавитьФайл.Действие = "ОД_Утвердить"; 
		Кно_ДобавитьФайл = ЭтаФорма.Элементы.Добавить("ОД_КнопкаУтвердить", Тип("КнопкаФормы"), Элементы.ФормаСоздатьПоШаблону.Родитель);
		Кно_ДобавитьФайл.Заголовок = "Утвердить";
		Кно_ДобавитьФайл.ИмяКоманды = "Команда_Утвердить";
		Кно_ДобавитьФайл.Видимость = Истина;
	Иначе 
		Ком_ДобавитьФайл = ЭтаФорма.Команды.Добавить("Команда_Утвердить");
		Ком_ДобавитьФайл.Заголовок = "Утвердить";
		Ком_ДобавитьФайл.Действие = "ОД_Утвердить"; 
		Кно_ДобавитьФайл = ЭтаФорма.Элементы.Добавить("ОД_КнопкаУтвердить", Тип("КнопкаФормы"), Элементы.ФормаСоздатьПоШаблону.Родитель);
		Кно_ДобавитьФайл.Заголовок = "Утвердить";
		Кно_ДобавитьФайл.ИмяКоманды = "Команда_Утвердить";
		Кно_ДобавитьФайл.Видимость = Ложь;
		
	КонецЕсли;
 	
	
	ДобавляемыеРеквизиты = Новый Массив;
	Реквизит_СуммаВыделенных = Новый РеквизитФормы("ОД_СуммаВыделенных",	 Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки()), , "Сумма выделенных");
	ДобавляемыеРеквизиты.Добавить(Реквизит_СуммаВыделенных);               
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	Эл_СуммаВыделенных = Элементы.Добавить("ОД_СуммаВыделенных", Тип("ПолеФормы"), Элементы.ФильтрыНастройкиИДопИнфо);
	Эл_СуммаВыделенных.Вид = ВидПоляФормы.ПолеНадписи;
	Эл_СуммаВыделенных.ПутьКДанным = "ОД_СуммаВыделенных";
	Эл_СуммаВыделенных.ТолькоПросмотр = Истина;
	Эл_СуммаВыделенных.Заголовок = "Сумма выделенных";
	ЭтаФорма.ОД_СуммаВыделенных = "0";
	//ВыбратьТолькоСвои();
	Если Пользователи.РолиДоступны("ОД_Видимость_Прораб_РП", ПользователиИнформационнойБазы.ТекущийПользователь()) И
		НЕ Пользователи.РолиДоступны("АдминистраторСистемы", ПользователиИнформационнойБазы.ТекущийПользователь()) Тогда
		ВыбратьТолькоСвои();	
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОД_Утвердить()

	МасУтв = Новый Массив;
	
	Для Каждого Значение из Элементы.Список.ВыделенныеСтроки Цикл
		
		МасУтв.Добавить(Значение);	
		
	КонецЦикла; 
	
	ОД_УтвердитьНаСервере(МасУтв); 
	
	Элементы.Список.Обновить();
	
	Сообщить("Документы утверждены!");
	
КонецПроцедуры
&НаСервере
Процедура ОД_УтвердитьНаСервере(МасУтв)

	Для Каждого Значение из МасУтв Цикл
		
		Попытка
			Об = Значение.ПолучитьОбъект();
			Об.СтатусУтвержденияПлатежа = ПредопределенноеЗначение("Перечисление.СтатусыУтвержденияПлатежей.Утвержден");
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОД_СписокПриАктивизацииСтрокиПосле(Элемент)
	
	МасСумм = Новый Массив;
	
	Для Каждого Значение из Элементы.Список.ВыделенныеСтроки Цикл
		МасСумм.Добавить(Значение);	
	КонецЦикла;
	
	ЭтаФорма.ОД_СуммаВыделенных = ПолучитьСуммуВыделенных(МасСумм);
	
КонецПроцедуры                
&НаСервере
Функция ПолучитьСуммуВыделенных(МасСумм)
	
	ИтогСумма = 0;
	
	Для Каждого Значение из МасСумм Цикл
		ИтогСумма = ИтогСумма + Значение.СуммаДокумента;		
	КонецЦикла;
	
	Если ИтогСумма = 0 Тогда
		Возврат "0";	
	Иначе
		Возврат "" + ИтогСумма;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ВыбратьТолькоСвои()

	ТекПол = ПользователиКлиентСервер.ТекущийПользователь();
	СписСсылок = ПолучитьСотрПоПольз(ТекПол);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = СписСсылок;
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрПоПольз(ТекПол)
	
	МасСотр = Новый Массив;
	Спис = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ТекПол);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МасСотр.Добавить(ВыборкаДетальныеЗаписи.Пользователь);	
	КонецЦикла; 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Пользователь
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходДСПлан.Ссылка КАК Расход,
		|	РасходДСПлан.ОД_ОтветственныйПрораб КАК ОД_ОтветственныйПрораб,
		|	РасходДСПлан.ДокументОснование.ОД_ОтветственныйПрораб КАК ДокументОснованиеОД_ОтветственныйПрораб
		|ПОМЕСТИТЬ ВТ_РАСХОД
		|ИЗ
		|	Документ.РасходДСПлан КАК РасходДСПлан
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РАСХОД.Расход КАК Расход
		|ИЗ
		|	ВТ_РАСХОД КАК ВТ_РАСХОД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Пользователь КАК ВТ_Пользователь
		|		ПО ВТ_РАСХОД.ДокументОснованиеОД_ОтветственныйПрораб = ВТ_Пользователь.Ссылка";
	
	Запрос.УстановитьПараметр("Ответственный", ТекПол);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Спис.Добавить(ВыборкаДетальныеЗаписи.Ссылка, "Ссылка");
	КонецЦикла;
	
	Возврат Спис;
	
КонецФункции
